{
  "backend/main.mo": "Defines actor with shipment, invoice, client, payment, and authentication data models plus in‑memory maps and rate‑limit logic for login and OTP.",
  "feature_evidence.json": "Feature evidence manifest listing two frontend features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files describing their behavior and purpose.",
  "frontend/.env": "Provides environment variable for the Google Maps API key.",
  "frontend/index.css": "Tailwind and CSS variables setup defining light/dark design tokens and base styles for the frontend.",
  "frontend/index.html": "Minimal HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Root application component handling landing page UI, WhatsApp quote form, shipment tracking, and conditional admin/client dashboards.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin client detail view showing client info with tabs for managing that client's shipments and invoices.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form component for adding or updating a client's profile, validating inputs and submitting changes via a mutation hook.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog workflow for creating and provisioning a client account, including principal validation, password generation, and mutation handling.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable table of client accounts with refresh and repair actions, allowing selection of a client for details.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard managing tabs for clients, tracking, revenue, history, and config, with logout and utility actions.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Panel for configuring and storing a Google Geocoding API key, showing current status and setup instructions.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that exports all invoices to a downloadable CSV file using a mutation hook.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Renders an admin table for viewing, creating, updating, and deleting invoices for a specific client. Includes status helpers, form handling, dialogs, and loading states.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Displays recent client login history with loading, error, empty states, and a table of entries. Fetches history via useGetLoginHistory.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Provides UI to view, save, and verify the MSG91 API key, including storage check, alerts, and asynchronous actions.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Shows revenue analytics using a line chart, with loading, error, and empty states. Pulls paid invoice revenue data via useGetRevenueData.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Static panel explaining that role management is disabled and admin access uses a single password.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Renders an admin table for managing shipments for a client, including creation, deletion, form dialogs, and loading states.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin map panel that lazily loads Google Maps and displays shipment markers only when enabled.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that catches UI crashes and displays a detailed error card with refresh and copy-to-clipboard options.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message when a user lacks required permissions.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated admin bootstrap card that displays a notice that Internet Identity admin setup is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Admin login form that authenticates using a password and displays errors or loading state.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button for admins that triggers logout and scrolls back to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that currently renders nothing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog with a form for company details; kept for compatibility.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipments and invoices with logout and WhatsApp support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays client invoices with status badges, error handling, and actions like download or pay.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Form card for clients to change their temporary password with validation and API mutation handling.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Tab-based wrapper showing login or signup cards and switching tabs after successful signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Client login form supporting password and OTP authentication with validation and API calls.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays a client's active and delivered shipments with loading, error, and authentication states.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Signup form for new client accounts with identifier validation, password checks, and API submission.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Context provider managing client session tokens in localStorage and exposing authentication state.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor tied to the current identity and refreshing dependent queries.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hooks to check admin bootstrap status and trigger the initial admin bootstrap via the actor API.",
  "frontend/src/hooks/useAdminSession.ts": "Implements admin session handling with token storage, validation, and login logic using an actor backend.",
  "frontend/src/hooks/useClientSession.ts": "Empty placeholder file for client session logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for client signup, login, OTP flows, and related backend interactions.",
  "frontend/src/index.css": "Global styles and Tailwind configuration including theme variables and DFC branding colors.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable invoice PDF by opening a styled HTML document in a new window.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty placeholder file for shipment-related storage utilities.",
  "frontend/src/lib/types.ts": "Defines local types for profiles, clients, and re-exports backend types for convenience.",
  "frontend/src/lib/whatsapp.ts": "Creates WhatsApp deep links for invoice reminders and customer support messages.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity, and renders the app.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps various auth-related error shapes and messages to concise, user‑friendly strings with pattern matching and fallbacks.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers, returning type, normalized value, and user-facing error messages.",
  "frontend/src/utils/queryErrorMessage.ts": "Extracts readable UI-safe messages from React Query errors, delegating auth-related cases to clientAuthErrors and handling common patterns.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a target element by ID, accounting for a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using both query strings and hash routing, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state, known issues, feature requirements, and pending fixes related to client signup errors."
}