{
  "backend/main.mo": "Defines data models, persistent maps, authorization mixin, rate limiting logic, and session handling for a logistics backend canister.",
  "feature_evidence.json": "Contains metadata describing a feature request for configuring the Google Maps API key and associated files, components, and tests.",
  "frontend-file-summaries.txt": "JSON-style text summarizing various frontend files and their functionality across the application.",
  "frontend/.env": "Stores the Google Maps JavaScript API key for frontend usage.",
  "frontend/index.css": "Defines Tailwind base layers and theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that mounts the React application.",
  "frontend/src/App.tsx": "Main React component managing global UI sections, login flows, tracking form, and conditional rendering for admin and client dashboards.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin view for a specific client showing company details and tabbed shipments and invoices sections.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Provides a form for admins to validate a client's Principal ID and create or update a client profile. Submits profile data via a mutation and handles form state and errors.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Implements a dialog to create a new client account using email or mobile, auto-generating a temporary password. Submits account creation and displays the generated password for copying.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable table of all clients with company, GST, and mobile info. Allows selecting a client for detailed viewing.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Renders the main admin dashboard with tabs for client management, tracking, revenue, MSG91, and exports. Handles authentication and client detail navigation.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Exports all invoices as a CSV file using a mutation and triggers a file download. Shows loading feedback and toast notifications.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Shows a client's invoices with status badges and options to add invoices, download PDFs, or send WhatsApp reminders. Supports invoice creation via dialog and mutation.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "UI panel for storing MSG91 API keys and verifying access tokens with backend validation and result display.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Displays revenue analytics using a line chart, handling loading, error, and empty states.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Static panel explaining that role management is disabled in password-only mode.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Shows a client's shipments and provides a dialog form to create new shipments.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Loads Google Maps and displays shipment markers using data from the backend with script-load safeguards.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Global React error boundary that displays error details and provides refresh and copy options.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message for users without required permissions.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated card explaining that admin bootstrap via Internet Identity is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Password-based admin login form with loading and error handling.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Admin logout button that logs out and scrolls to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login button component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog collecting company and contact info but no longer used; submits and closes without processing.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard with logout, support link, and tabbed views for shipments and invoices.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays a client's invoices with status badges and actions like PDF download and payment.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Card for clients to change a temporary password with form validation and mutation handling.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Auth wrapper providing login and signup tabs and switching to login after successful signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Login card supporting password-based and OTP login flows with validation and related mutations.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays active and delivered shipments for a client using query hooks and renders tables with loading and empty states.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Implements a client signup form with validation, mutation handling, and success/error messaging.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Provides context for storing and managing a client session token in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Adds hooks to check admin bootstrap status and run the initial admin bootstrap mutation.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin login, token validation, logout, and session persistence with localStorage.",
  "frontend/src/hooks/useClientSession.ts": "Empty file placeholder with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, identity loading, login state, and exposes identity through context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for admin and client operations including clients, shipments, and bootstrap mutations.",
  "frontend/src/index.css": "Tailwind setup with theme variables, dark mode overrides, base styles, and custom gold utility classes.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML invoice in a new window using provided invoice data.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp deep links for payment reminders and support messages with formatted text.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps backend authentication errors to user-friendly messages with fallback handling.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers and returns structured results.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls to a section with a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, animations, and using plugins.",
  "project_state.json": "Describes project state, goals, and requirements for integrating Google Maps into the admin dashboard."
}