{
  "backend/main.mo": "Defines core types and in-memory maps for shipments, invoices, clients, payments, accounts, sessions, and rate limiting with authorization mixin and various configuration fields.",
  "feature_evidence.json": "Feature evidence report describing a UI error‑handling update, listing involved files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files, detailing behavior of components, hooks, and utilities.",
  "frontend/.env": "Environment file containing the Google Maps API key for frontend usage.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables for light and dark modes with applied global design tokens.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling landing UI, tracking form, WhatsApp quotes, and lazy‑loaded dashboards with session‑based routing.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin detail view showing client info and tabbed shipments and invoices tables.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for validating a principal ID and updating a client's profile, with mutation submission and error handling.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog for creating a client login account, validating principal IDs, generating temp passwords, and provisioning account linkage.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays all clients with search, refresh, and detail view navigation using fetched client data.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard providing tabbed access to client management, tracking, revenue, login history, and configuration panels.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Panel to check, enter, and store the Google Geocoding API key with status indicators and setup instructions.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that triggers CSV export of all invoices using a mutation and downloads the generated file.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Renders a table of invoices for a client with create and delete dialogs, using query hooks for CRUD operations.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Displays client login history with loading, error, and empty states, sorting entries by timestamp.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Provides UI to view, save, and verify the MSG91 API key using related query hooks.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Fetches revenue data and shows analytics with a line chart, handling loading, error, and empty states.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Shows a static notice explaining role management is disabled under password-only authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Renders a shipments table for a client with create and delete functionality using shipment query hooks.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin map panel that conditionally loads Google Maps script and renders shipment markers with error handling.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that catches UI errors and displays a styled error screen with options to refresh or copy error details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message for users lacking permission to view a section.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated admin bootstrap UI card indicating Internet Identity admin setup is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Password-based admin login form handling authentication and error display.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button for admin users that triggers session logout and scrolls to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated dialog for collecting profile details; form submits and closes but is unused.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipments and invoices with logout and WhatsApp support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays client invoices with status badges, errors, and authentication checks.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Password change form enforcing validation and calling the password‑update mutation, with error handling and success callback.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Auth container that toggles between login and signup tabs and switches back to login after successful signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Login UI supporting password and OTP flows, validating inputs and invoking related authentication mutations with error handling.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays active and delivered client shipments with authentication checks, error handling, and linkage‑error messaging.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Signup form validating identifier and password fields and submitting new account data, resetting on success.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Provides client session token context with methods to set and clear tokens and exposes authentication status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hooks to check admin bootstrap status and trigger the bootstrap process, updating cached state on success.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, validating them with the backend and handling login with detailed error mapping.",
  "frontend/src/hooks/useClientSession.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider using AuthClient to manage login state, stored identities, and authentication helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin and client data fetching, including clients, shipments, revenue, and login history with variant response handling.",
  "frontend/src/index.css": "Configures Tailwind CSS layers, theme variables, dark mode, and custom DFC gold color utilities.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable invoice PDF by opening a styled HTML document in a new window and triggering print.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty file with no implementation.",
  "frontend/src/lib/types.ts": "Defines local types for clients, profiles, and login history, and re-exports backend shipment and invoice types.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp deep links for invoice payment reminders and support messages with formatted text.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps raw backend auth errors to concise, user‑friendly English messages with special handling for service unavailability and validation cases.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers, returning structured results with clear validation errors.",
  "frontend/src/utils/queryErrorMessage.ts": "Extracts readable UI messages from React Query errors and delegates auth‑related errors to the clientAuthErrors mapper.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a target element with a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Project state file describing versions, known issues, existing features, and pending backend feature requests."
}