{
  "backend/main.mo": "Defines the main actor with shipment, invoice, client, payment, account, and session models plus storage, authorization mixin, API keys, rate limiting, admin auth, and persistent login history state.",
  "backend/migration.mo": "Provides a migration function that adds an empty loginHistory map when upgrading from the old actor state.",
  "feature_evidence.json": "Lists feature evidence entries describing frontend login‑history UI additions and React Query wiring, including affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files including components, hooks, utilities, and styling configuration.",
  "frontend/.env": "Stores the Google Maps API key for frontend usage.",
  "frontend/index.css": "Defines Tailwind base layers and an OKLCH‑based color system with light and dark theme variables.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling admin/client authentication, client portal routing, shipment tracking, and hero/contact forms.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin client‑detail view showing company info and tabbed shipments/invoices using child table components.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for creating or updating a client profile using a Principal ID, including validation and submission via admin API mutations.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog workflow for provisioning a new client account with email/mobile login and a generated temporary password.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable table of all clients and allows selecting a client for detailed view.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard organizing client management, tracking, revenue, login history, and configuration panels with authentication gating.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Panel for viewing configuration status and saving or updating the Google Geocoding API key.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that exports all invoices to a CSV file via an admin export mutation.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Displays a client’s invoices with options to add new ones, generate PDFs, and send WhatsApp reminders.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Shows client login history with loading, error states, and a sortable table of login entries.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Manages MSG91 API key storage and verifies access tokens with detailed success/error handling.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Fetches revenue data and renders a line chart with total revenue and loading/error fallback UI.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Static panel indicating that role management is disabled under password-only authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Displays a client’s shipments and allows creating new shipments through a dialog form.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Google Maps panel for admins that loads the map script, initializes a styled map, and renders shipment markers with coordinate validation.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a detailed error UI with options to refresh or copy error info.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with an icon and description for unauthorized users.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated admin bootstrap card showing a notice that Internet Identity-based admin setup is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Password-based admin login form handling authentication, loading state, and error display.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button for admins that triggers logout and scrolls the page to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog with a form for company info, retained for compatibility.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipments and invoices with logout and WhatsApp support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays a client's invoice list with status badges and actions like PDF download and payment.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "UI card for clients to change temporary passwords with validation and mutation handling.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Tab-based auth component switching between login and signup forms for clients.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Client login card supporting password login and OTP-based login with validation and mutations.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays active and delivered client shipments using fetched account status and shipment data.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Signup form for new clients with validation, signup mutation, and success handling.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Context provider managing client session tokens in localStorage with auth helpers.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing backend actors tied to Internet Identity with reactive refetching.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hooks for checking admin bootstrap status and running the initial admin bootstrap mutation.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, validates them with the actor service, and exposes login/logout helpers.",
  "frontend/src/hooks/useClientSession.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and helpers for login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin bootstrap, client management, and shipment retrieval using actor APIs and session tokens.",
  "frontend/src/index.css": "Sets up Tailwind and custom theme variables, including DFC branding colors and utility classes.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable invoice PDF by opening a styled HTML document in a new window and invoking print.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/whatsapp.ts": "Creates WhatsApp deep links for payment reminders and support messages using predefined templates.",
  "frontend/src/main.tsx": "Initializes React root, sets up QueryClient and InternetIdentityProvider, and renders the app.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps backend client-auth error messages to user-friendly strings with specific handling for common cases.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or 10‑digit mobile identifiers and returns structured validation results with error messages.",
  "frontend/src/utils/scrollToSection.ts": "Smooth-scrolls to a DOM element by id with a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Describes project state and requirements for implementing client login history storage and admin‑side retrieval."
}