{
  "backend/main.mo": "Defines data models and in-memory maps for shipments, invoices, clients, payments, accounts, sessions, OTP, and rate limiting, with authorization mixins and admin credentials.",
  "backend/migration.mo": "Simple migration module that sets and returns the admin password value.",
  "feature_evidence.json": "Feature evidence report describing a frontend requirement for consistent admin login error handling.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering components, hooks, utilities, and configurations.",
  "frontend/.env": "Contains environment variable for the Google Maps API key.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for themes and applying global background and text colors.",
  "frontend/index.html": "Basic HTML template loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main React component managing authentication, landing sections, shipment tracking, and lazy-loaded dashboards.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin view showing a client's details with tabs for managing shipments and invoices.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form component for adding or updating a client profile, handling validation and submission via a mutation hook.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog for creating and provisioning a client account, including password generation and principal ID validation.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable table of client accounts with options to refresh data and repair unlinked accounts.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard organizing client management, tracking, revenue, history, and config panels with logout and utility actions.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Panel for checking and storing a Google Geocoding API key, with status alerts and configuration form.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that triggers CSV export of all invoices using a mutation and downloads the generated file.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Displays and manages invoices for a client, including creation, deletion, and status handling with dialogs and forms.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Shows client login history with loading, error, and empty states using a table layout.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Manages MSG91 API key storage and verification with input controls and status alerts.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Fetches and visualizes revenue data using a line chart with full loading and error states.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Static panel explaining that role management is disabled under password-only authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Displays and manages client shipments, supporting creation, deletion, and optional coordinates with a form dialog.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin map panel that conditionally loads Google Maps and displays shipment markers using fetched shipment data.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that captures and displays application errors with options to refresh or copy details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access‑denied message UI for unauthorized users.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated admin bootstrap card showing that Internet Identity setup is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Admin login form using password authentication with error handling and loading states.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button that triggers admin logout and scrolls back to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog with form fields but no active submission logic.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard with tabs for shipments and invoices plus logout and support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Invoice table for clients with authentication checks, status badges, and error handling.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Password change form enforcing validation and submitting via useChangeClientPassword; shows errors and calls onSuccess on completion.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Auth UI toggling between login and signup tabs, switching back to login after successful signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Login card supporting password and OTP modes with validation, error handling, and query-based authentication actions.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays client shipments with authentication checks, loading/error handling, and separation of active vs delivered shipments.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Signup form validating identifier and password, submitting new client accounts, handling errors, and notifying parent on success.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Context provider managing client session tokens in localStorage with helpers for setting and clearing authentication state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hooks for checking admin bootstrap status and triggering initial admin creation using the backend actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, including validation, login handling with backend variants, and logout logic with localStorage persistence.",
  "frontend/src/hooks/useClientSession.ts": "Empty file placeholder for client session hook implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for client auth flows, OTP actions, and data fetching/mutations using the backend actor and session state.",
  "frontend/src/index.css": "Global Tailwind CSS setup with theme variables, dark mode styles, and custom DFC gold utility classes.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML invoice PDF in a new window using styled templates and auto-print behavior.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty file placeholder for shipment storage utilities.",
  "frontend/src/lib/types.ts": "Defines local types for user and client data while re-exporting shipment and invoice types from the backend.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp deep links for invoice reminders and support messages with formatted text.",
  "frontend/src/main.tsx": "Initializes the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps various error shapes and messages to concise, user-friendly authentication error strings.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers, returning type, normalized value, and user-facing errors.",
  "frontend/src/utils/queryErrorMessage.ts": "Converts React Query errors into safe user-friendly messages, delegating auth-related cases to clientAuthErrors.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a target element with a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using both query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings with plugins enabled.",
  "project_state.json": "Project state describing admin login issues, existing feature requirements, and pending admin-auth backend fixes."
}