{
  "backend/main.mo": "Main canister actor defining data models, storage maps, authorization mixin, admin/client auth state, rate limiting, and shipment/invoice/payment/client management logic.",
  "backend/migration.mo": "Migration module converting old shipment records into a new format by adding a coordinates field set to null.",
  "feature_evidence.json": "Feature evidence report mapping requested features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their purpose and behavior in the app.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and applying global styling tokens.",
  "frontend/index.html": "Base HTML page loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling admin/client sessions, quoting form submission, shipment tracking, and conditional portal rendering.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Displays a selected client’s profile and provides shipment and invoice tabs with tables. Includes a back button and formatted client details.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for creating or updating a client profile using a Principal ID. Handles validation, submission, and profile field inputs.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Modal dialog to create a new client account with email/mobile and auto‑generated temporary password. Handles form submission, password copying, and success state.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Fetches and displays a searchable table of all clients. Allows selecting a client to view details.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard showing tabs for clients, client creation, tracking, revenue, MSG91 config, and invoice export. Handles authentication and client detail navigation.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that exports all invoices as a CSV file using a mutation hook. Shows loading state and success/error toasts.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Shows all invoices for a client, lets admins create new invoices, download PDFs, and send WhatsApp reminders. Includes status badges and form dialog for invoice creation.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "UI for storing the MSG91 API key and verifying access tokens with feedback and error handling.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Displays revenue analytics with loading, error, empty states, and a line chart of revenue over time.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Static panel explaining that role management is disabled under password-only authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Shows a client's shipments and provides a dialog form to create new shipments.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin panel rendering a Google Map with shipment markers, loading states, error handling, and dynamic script loading for the Maps API.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary that displays detailed error information and offers refresh and copy-to-clipboard options.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen indicating lack of permission to access a section.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated card explaining that Internet Identity-based admin bootstrap is unavailable in password-only mode.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Password-based admin login form with loading, validation, and error display.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button that ends the admin session and scrolls back to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog collecting company details but no longer used; submits a form and closes the dialog.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipment and invoice tabs with logout and WhatsApp support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays client's invoices with status badges and actions like PDF download and payment, loading data via hooks.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Card for mandatory client password change with validation and mutation-based submission.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Wrapper providing login and signup tabs for the client portal.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Login card supporting password-based and OTP-based authentication with validation and related mutations.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays active and delivered shipments for a client using query hooks, with loading states and table layouts.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Provides a client signup form with validation, mutation submission, success handling, and error messaging.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Manages client session tokens via context, enabling storage, retrieval, and clearing of the client session state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Exposes queries and mutations to check and perform admin bootstrap actions using the backend actor.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin session tokens, validating stored tokens, performing admin login/logout, and clearing cache on logout.",
  "frontend/src/hooks/useClientSession.ts": "Empty file placeholder for client session hook implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, providing identity loading, login, clearing, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines admin, client, and shipment-related queries and mutations, integrating session tokens and backend actor calls.",
  "frontend/src/index.css": "Sets up Tailwind layers, defines light/dark theme CSS variables, global styles, and gold utility classes.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML invoice in a new window using styled inline HTML for PDF output.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/whatsapp.ts": "Creates WhatsApp deep links for invoice reminders and support messages with formatted text.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps backend auth error messages to user-friendly strings with specific cases and a fallback.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers with detailed error handling.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls to a DOM element with an offset for fixed headers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom color variables, plugins, and responsive container settings.",
  "project_state.json": "Describes the project’s current architecture, features, known issues, and pending feature requests for a Node/Express + MySQL web app with admin and client dashboards."
}