{
  "backend/main.mo": "Defines data types and in‑memory maps for shipments, invoices, clients, authentication, rate‑limiting, and includes authorization mixin with admin password and session logic.",
  "backend/migration.mo": "Migration module that preserves actor data while resetting adminPassword to a fixed value.",
  "feature_evidence.json": "Feature evidence report listing frontend files and components involved in admin login, session validation, and error‑messaging fixes.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files used for reference in build planning.",
  "frontend/.env": "Environment file containing the Google Maps API key.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry point mounting the app root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication states, landing-page UI, tracking form, and lazy-loaded dashboards.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Displays detailed info for a selected client and shows shipments or invoices via tabbed panels.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for creating or updating a client profile with validation and mutation submission.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog to create and provision a client account, including password generation and principal validation.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Lists all client accounts with search, refresh, and repair tools, allowing selection for detailed view.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard with tabs for clients, tracking, revenue, history, and config, plus client provisioning and export actions.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Panel to view and update Google Geocoding API key status and submit new keys.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that exports all invoices to a CSV file using a mutation hook.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Displays and manages client invoices, including creation, update, and deletion with status handling and form dialogs.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Fetches and displays client login history with loading, error, and empty-state handling in a table view.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Allows admins to set and verify the MSG91 API key, showing stored status and providing input and action buttons.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Loads and visualizes revenue data using a line chart, with dedicated states for loading, errors, and missing data.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Shows a static notice explaining that role management is disabled under password-only admin authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Provides CRUD management for client shipments, including creation dialogs, listing, and deletion with optional coordinates.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin map panel that conditionally loads Google Maps, initializes the map, and displays shipment markers when enabled.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that captures and displays application errors with options to refresh or copy error details.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message when a user lacks permission.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated card informing that Internet Identity–based admin bootstrap is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Admin login form using password-based authentication with error handling and loading states.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button for admins that triggers session logout and scrolls to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog with form fields; kept for compatibility.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipments and invoices with logout and WhatsApp support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays client invoices with status badges, error states, and actions like pay or download PDF.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Provides a form for clients to change their temporary password with validation and error handling.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Displays login and signup tabs for client portal authentication and switches tabs after signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Implements client login via password or OTP with validation, API calls, and error messaging.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Fetches and displays client shipments, handling authentication, linkage errors, loading states, and errors.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Handles client signup with identifier validation, password checks, and submission to the signup API.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Manages client session tokens using context and localStorage, exposing auth state and token methods.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Provides hooks to check admin bootstrap status and trigger initial admin setup using the backend actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens with validation, login handling, and error mapping using an actor backend.",
  "frontend/src/hooks/useClientSession.ts": "Empty placeholder file for client session hook logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for client signup, login, OTP handling, and invalidating related cached data using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables, dark mode styles, and utility classes for DFC branding.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML-based invoice PDF in a new browser window.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty module reserved for shipment storage utilities.",
  "frontend/src/lib/types.ts": "Defines local types for user, client, and login history while re-exporting backend types.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp deep links for invoice reminders and support messages with formatted content.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering the root component.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps various error shapes and messages to short, user-friendly authentication error strings.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile inputs, returning type, cleaned value, and user-facing errors.",
  "frontend/src/utils/queryErrorMessage.ts": "Converts React Query errors into safe user-friendly messages, delegating auth-related errors to clientAuthErrors.",
  "frontend/src/utils/scrollToSection.ts": "Smooth-scrolls to a DOM element by id with a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using both query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, plugins, and content paths.",
  "project_state.json": "Stores project metadata, known issues, and required features for fixing admin login behavior."
}