{
  "backend/main.mo": "Defines shipment, invoice, client, payment, account, and session types with in-memory maps and rate‑limit logic for authentication and OTP handling.",
  "backend/migration.mo": "Migration module passing through the adminPassword field unchanged.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend source files and components.",
  "frontend/.env": "Environment file containing the Google Maps API key.",
  "frontend/index.css": "Tailwind base stylesheet defining design tokens and light/dark theme color variables.",
  "frontend/index.html": "Base HTML entry point loading the Vite React application.",
  "frontend/src/App.tsx": "Main React app component handling home page UI, tracking form, authentication transitions, and lazy‑loaded dashboards.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin view showing a client's info with tabs for their shipments and invoices.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form component for adding or updating a client's profile, handling validation and mutation submission.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog for creating and provisioning a client account, including password generation and principal validation.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable table of client accounts with options to refresh, repair unlinked clients, and select a client.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard with tabs for clients, tracking, revenue, history, and configuration, plus global actions like provisioning and logout.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Panel to view and configure the Google Geocoding API key with status checks and submission form.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that triggers CSV export of all invoices using a mutation and downloads the file.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Provides an admin interface to list, create, update, and delete client invoices with status handling and form dialogs.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Displays client login history with loading, error, and empty states using a table layout.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Allows admins to store and verify the MSG91 API key, showing status indicators and providing input controls.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Fetches and visualizes revenue data in a line chart with handling for loading, errors, and empty datasets.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Shows a static notice explaining that role management is disabled under password-only authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Manages client shipments with listing, creation, and deletion features, including optional coordinate handling and form dialogs.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin panel that conditionally loads Google Maps and displays shipment markers with error handling and cleanup.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary component that catches app errors and shows a styled error UI with refresh and copy-to-clipboard options.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message when a user lacks required permissions.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated admin bootstrap UI showing that Internet Identity-based setup is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Password-based admin login form with error handling and loading state.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button for admin users that logs out and scrolls to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog with form fields but no real submission logic.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard with logout, support link, and tabs for shipments and invoices.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays client invoices with status badges, login checks, error states, and invoice actions like download or pay.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "UI card for clients to change their temporary password with validation and mutation handling.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Renders login/signup tabs and switches to login after successful signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Login card supporting password and OTP authentication with validation and query hooks.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Displays client shipments with loading, error, authentication, and linkage error handling.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Signup form for clients with identifier normalization, password validation, and signup mutation.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Provides client session token context with helpers to set/clear tokens and track authentication state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hooks for checking and triggering admin bootstrap actions using the actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, including validation, login, storage, and error handling using an actor backend.",
  "frontend/src/hooks/useClientSession.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for client signup, login, OTP flow, and data fetching, integrating with backend actor methods and session handling.",
  "frontend/src/index.css": "Sets global styles, Tailwind layers, theme variables, dark mode values, and DFC gold color utilities.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable invoice PDF by rendering styled HTML in a new window and triggering the browser print dialog.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty file with no implementation.",
  "frontend/src/lib/types.ts": "Defines local client, profile, and login history types and re-exports backend types for shared use.",
  "frontend/src/lib/whatsapp.ts": "Creates WhatsApp deep links for invoice reminders and support messages, formatting phone numbers and encoding message text.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps various error shapes to short, user-friendly authentication error messages.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers and returns structured validation results.",
  "frontend/src/utils/queryErrorMessage.ts": "Converts React Query errors into clean user-facing messages, using auth error mappings when relevant.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a DOM element offset by a fixed header height.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state and notes issues regarding admin password update and persistence."
}