{
  "backend/main.mo": "Actor defines data models, persistent maps, authorization mixin, and rate-limiting plus session/OTP handling for clients and admin.",
  "backend/migration.mo": "Migration module converting old client accounts to a new format by adding role and createdAt fields.",
  "feature_evidence.json": "Feature evidence listing features, related source files, components, and test IDs for signup UI and protected client dashboard.",
  "frontend-file-summaries.txt": "Text file of prewritten summaries describing behaviors of various frontend components and utilities.",
  "frontend/index.css": "Tailwind base layer with OKLCH color variables and dark-mode theme tokens for global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling admin/client authentication flows, shipment tracking, quote form, and conditional client portal rendering.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin view showing client info and tabs for managing shipments and invoices.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for validating a client principal and updating or creating client profile details using admin actions.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog workflow for provisioning a new client account with email/mobile login and a generated temporary password.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable list of clients and allows selecting a client to view details.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin control panel with tabs for managing clients, adding clients, MSG91 settings, and invoice exports.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button that triggers invoice export to CSV and downloads the generated file.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Shows invoices for a client and supports creating invoices, downloading PDFs, and sending WhatsApp reminders.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "UI for saving MSG91 API keys and verifying access tokens with validation and toast feedback.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Admin-only interface to grant or revoke admin privileges using principal IDs with validation and error handling.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Displays a client's shipments and provides a dialog for creating new shipments.",
  "frontend/src/components/AdminTrackingPanel.tsx": "File is empty or placeholder with no implemented component.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Static screen shown when a user lacks permission to access a section.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated card indicating Internet Identity admin bootstrap is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Password-based admin login form with validation, loading state, and error display.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Button that logs out an admin and scrolls back to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that renders nothing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog that returns null.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipments and invoices with logout support and tab navigation.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays a client’s invoices with status badges and actions for downloading PDFs or paying pending invoices.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Provides a form for clients to change their password with validation and backend mutation handling.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Wraps login and signup tabs for the client portal, switching views after successful signup.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Handles client login via password or OTP, including validation, OTP sending, and authentication flows.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Fetches and displays active and delivered client shipments in separate tables with loading states.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Renders a signup form with validation and submits new client accounts to the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Provides hooks to check if admin is bootstrapped and to bootstrap the first admin, invalidating related queries on success.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin authentication token lifecycle, including login, logout, validation, and local storage handling.",
  "frontend/src/hooks/useClientSession.ts": "Handles client session token storage, validation, and clearing using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for authentication, exposing identity state and login/logout controls.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for validating admin sessions and performing admin and client operations for clients, shipments, and invoices.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, color variables, dark mode themes, and custom gold utility classes.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML invoice in a new window and triggers browser print for PDF export.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty placeholder file for shipment storage utilities.",
  "frontend/src/lib/whatsapp.ts": "Creates WhatsApp reminder deep links by formatting mobile numbers and generating encoded reminder messages.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers, then renders the root component.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps backend authentication error messages to short user-friendly client messages with fallbacks and logging for unmapped errors.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers, returning structured results with specific user-facing error messages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current state, features, architecture notes, and pending feature requests for implementing MySQL-backed authentication and protected client dashboard flows."
}