{
  "backend/main.mo": "Defines the main actor with shipment, invoice, client, payment, and session data models plus persistent maps, authentication, rate‑limiting, and admin/client session logic.",
  "backend/migration.mo": "Provides a migration module that maps old actor state structures to the new format by returning the old state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists high‑level summaries for all frontend files, including UI components, hooks, utilities, and admin/client portal features.",
  "frontend/index.css": "Global Tailwind base styles defining light/dark theme CSS variables and applying background and text colors.",
  "frontend/index.html": "Base HTML document loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app routing admin and client flows, public tracking, and quote form while managing sessions and backend interactions.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Admin view showing detailed client info with tabs for managing shipments and invoices.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for creating or updating a client by principal ID with validation and mutation handling.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog for provisioning a new client account with optional email/mobile and generating a temporary password.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Displays a searchable table of clients and lets admins select a client for details.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard with tabs for clients, adding clients, MSG91 settings, and invoice export, including session validation.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Exports all invoices as a CSV file using a mutation and triggers a browser download.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Shows a client's invoices, supports creating new invoices, downloading PDFs, and sending WhatsApp reminders.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "UI panel for saving a MSG91 API key and verifying access tokens with backend mutations and result parsing.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Admin interface to grant or revoke admin roles using Principal IDs with validation and permission checks.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Displays a client's shipments and provides a dialog to create new shipments through a form.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Empty file with no implemented component content.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen showing an access denied message to unauthorized users.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated card indicating that Internet Identity bootstrap is not available in password-only mode.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Admin login UI allowing password-based authentication with error handling and loading states.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Logout button that clears the admin session and scrolls to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login component that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog that returns null under the new admin flow.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing shipments and invoices with logout handling and tab navigation.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Displays a client's invoices with status badges and actions for PDF download and payment, using invoice data fetched from a query.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Provides a form for clients to change their temporary password with validation and backend mutation handling.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Implements client login via password or OTP, including validation, OTP sending, verification, and authentication flows.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Shows active and delivered shipments for a client, fetched from the backend and grouped into two tables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor bound to the current identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Provides queries and mutations to check admin bootstrap status and initialize the first admin account.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, including login, logout, validation, and local storage persistence.",
  "frontend/src/hooks/useClientSession.ts": "Handles storing, retrieving, and clearing the client session token with simple authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin session validation and CRUD operations on clients, shipments, and invoices using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind styles, theme variables, dark mode settings, typography, and custom gold color utilities for the UI.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML-based invoice PDF in a new browser window using invoice metadata.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty module with no implemented functionality.",
  "frontend/src/lib/whatsapp.ts": "Builds a WhatsApp deep-link message for invoice payment reminders using sanitized mobile numbers.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps backend authentication error messages to user-friendly client-facing messages with safe fallbacks.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes client identifiers, supporting email and 10‑digit mobile number formats with descriptive error feedback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, plugins, and container settings for the frontend.",
  "project_state.json": "Stores the project’s state, feature requirements, and pending requests related to client login, onboarding, and password flows."
}