{
  "backend/main.mo": "Defines types and in‑memory maps for shipments, invoices, clients, payments, sessions, and OTPs, with rate‑limit logic and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related frontend files, components, and test references for client portal authentication flows.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files for reference.",
  "frontend/.env": "Environment file providing the Google Maps API key for the frontend.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component handling landing page sections, client/admin login flows, shipment tracking, and lazy‑loaded dashboards with scroll logic.",
  "frontend/src/components/admin/AdminClientDetail.tsx": "Displays a client's profile details and provides tabs for viewing associated shipments and invoices.",
  "frontend/src/components/admin/AdminClientForm.tsx": "Form for creating or updating a client profile, including validation and mutation handling.",
  "frontend/src/components/admin/AdminClientProvisionDialog.tsx": "Dialog workflow for creating and provisioning a client account, including password generation and principal validation.",
  "frontend/src/components/admin/AdminClientsTable.tsx": "Lists all client accounts with search, refresh, and selection capabilities.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin interface providing navigation between clients, tracking, revenue, login history, and configuration panels.",
  "frontend/src/components/admin/AdminGoogleGeocodingPanel.tsx": "Interface to configure and store a Google Geocoding API key with status indicators.",
  "frontend/src/components/admin/AdminInvoiceExportButton.tsx": "Button to export all invoices as a CSV file using a backend mutation.",
  "frontend/src/components/admin/AdminInvoicesTable.tsx": "Renders an admin table for viewing, creating, updating, and deleting client invoices with a form dialog and status helpers.",
  "frontend/src/components/admin/AdminLoginHistoryPanel.tsx": "Displays recent login history with loading, error, and empty states using a table layout.",
  "frontend/src/components/admin/AdminMsg91Panel.tsx": "Provides UI to view, store, and verify the MSG91 API key with status indicators and form inputs.",
  "frontend/src/components/admin/AdminRevenuePanel.tsx": "Shows revenue analytics with loading and error states and renders a line chart of paid invoice amounts.",
  "frontend/src/components/admin/AdminRoleManagement.tsx": "Static panel explaining that role management is disabled under password-only authentication.",
  "frontend/src/components/admin/AdminShipmentsTable.tsx": "Renders an admin table for managing client shipments, including creation, deletion, and optional coordinate handling.",
  "frontend/src/components/AdminTrackingPanel.tsx": "Admin panel component that conditionally loads Google Maps and renders shipment markers using useGetAllShipmentsForMap.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Provides a React error boundary that displays error details and offers refresh and copy-to-clipboard actions.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message when a user lacks permission to view a section.",
  "frontend/src/components/auth/AdminBootstrapCard.tsx": "Deprecated admin bootstrap UI informing users that identity-based setup is unavailable.",
  "frontend/src/components/auth/AdminLoginCard.tsx": "Renders a password-based admin login form with loading and error handling.",
  "frontend/src/components/auth/AdminLogoutButton.tsx": "Provides a logout button that ends the admin session and scrolls back to the home section.",
  "frontend/src/components/auth/LoginButton.tsx": "Deprecated Internet Identity login button that returns null.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Deprecated profile setup dialog containing a form for company details.",
  "frontend/src/components/client/ClientDashboard.tsx": "Client dashboard showing tabs for shipments and invoices with logout and support actions.",
  "frontend/src/components/client/ClientInvoicesTable.tsx": "Loads and displays client invoices with status badges, authentication checks, and error states.",
  "frontend/src/components/client/ClientPasswordChangeCard.tsx": "Provides a password change form with validation and mutation handling for clients required to update temporary passwords.",
  "frontend/src/components/client/ClientPortalAuthCard.tsx": "Displays login and signup tabs for the client portal and switches views based on user actions.",
  "frontend/src/components/client/ClientPortalLoginCard.tsx": "Implements client login via password or OTP, including form validation and query-based authentication.",
  "frontend/src/components/client/ClientShipmentsTable.tsx": "Fetches and displays a client’s active and delivered shipments with authentication and error handling states.",
  "frontend/src/components/client/ClientSignupCard.tsx": "Renders a signup form for new clients, validating identifiers and passwords before submitting the signup mutation.",
  "frontend/src/hooks/ClientSessionProvider.tsx": "Manages client session tokens via context, providing auth state and helpers to set or clear the token.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Provides hooks to check admin bootstrap status and trigger initial admin creation using the actor.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens, validates them via actor calls, and handles login with detailed error mapping.",
  "frontend/src/hooks/useClientSession.ts": "Empty or missing implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for client signup, login, OTP flow, and related backend interactions with error handling.",
  "frontend/src/index.css": "Configures global styles, Tailwind layers, theme variables, and custom gold utility classes.",
  "frontend/src/lib/pdf/invoicePdf.ts": "Generates a printable HTML invoice PDF in a new window using provided invoice data.",
  "frontend/src/lib/shipmentsStorage.ts": "Empty or placeholder file.",
  "frontend/src/lib/types.ts": "Defines local client-related types and re-exports shipment and invoice types from the backend.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp deep links for payment reminders and support messages with formatted content.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/clientAuthErrors.ts": "Maps various auth and network error formats to short user-friendly messages with pattern-based handling and backend variant support.",
  "frontend/src/utils/clientIdentifier.ts": "Validates and normalizes email or mobile identifiers, returning standardized error messages and cleaned values.",
  "frontend/src/utils/queryErrorMessage.ts": "Converts React Query errors into safe user-facing messages, delegating auth-related cases to the auth error mapper.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a DOM element by ID with a fixed header offset.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state and requirements related to re-enabling client portal login and signup flows and implementing needed auth APIs."
}