{
  "kind": "build_request",
  "title": "Fix service-unavailable errors for Admin Login and Client Shipments/Delivery History loading",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement the missing backend (Motoko) admin session APIs used by the frontend so Admin Login no longer fails with “Service unavailable. Please contact support.” when the app attempts to call `actor.adminLogin(...)` and validate tokens via `actor.getAllClients(...)`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "unavailable. Please contact support."
        ]
      },
      "acceptanceCriteria": [
        "`adminLogin(password, token)` exists on the backend canister and does not produce method-not-found / not-a-function errors from the frontend.",
        "On successful admin login, the frontend stores `admin_session_token` and the Admin section proceeds past the login card without showing the 'Service unavailable' alert.",
        "When an invalid password is provided, the backend returns/throws a clear, user-actionable English error (not a generic trap), and the frontend displays it."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the missing backend (Motoko) shipment/history APIs referenced by the frontend so the Client Dashboard can load shipments and delivery history without failing (including `getClientShipmentsBySessionToken(sessionToken)` and any other shipment methods that the frontend calls after login).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Failed to load delivery history. Please try again or contact support.\n\nFailed to load shipments. Please try again or contact support."
        ]
      },
      "acceptanceCriteria": [
        "The Client Dashboard no longer shows the red error alerts for shipments/delivery history when the user is authenticated with a valid `sessionToken`.",
        "Backend responses for client shipment retrieval are compatible with the frontend’s `unwrapVariantResponse` expectations (variant-style success/noSessionToken/notLinked), so the query resolves to an array of shipments on success.",
        "If the `sessionToken` is missing/expired, the backend returns the appropriate variant (e.g., `noSessionToken`) and the frontend handles it without crashing."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Client Shipments/Delivery History UI error handling to display the real error message returned by React Query (when available) instead of always showing only the generic fallback text, while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Failed to load delivery history. Please try again or contact support.\n\nFailed to load shipments. Please try again or contact support."
        ]
      },
      "acceptanceCriteria": [
        "When shipment/history loading fails, the UI renders a user-friendly message derived from the thrown error (e.g., session expired, account not linked, service unavailable), not only the fixed generic string.",
        "The UI continues to show a safe generic fallback message if the error is missing/empty/too technical.",
        "No changes are made to read-only paths listed in `frontend.immutablePaths`."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Use English for any user-facing text.",
    "Do not edit files under `frontend/src/components/ui` or any other `frontend.immutablePaths` entries; compose existing UI components instead."
  ],
  "nonGoals": [
    "Adding new product features unrelated to fixing the failing admin login and shipment/history loading flows.",
    "Integrating third-party auth providers beyond existing Internet Identity support.",
    "Adding external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}