{
  "kind": "build_request",
  "title": "Add client login history tracking and admin view",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Backend: Add persistent storage for a login history log that records each successful client login with fields: client identifier (email or mobile as entered), resolved client_id (client principal/text ID used by the session), login_time (server timestamp), and ip_address (optional text).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "Solution: Login History System Add Karna Hoga ... store each successful client login (time, email, client_id, IP)"
        ]
      },
      "acceptanceCriteria": [
        "A new LoginHistoryEntry data type exists in backend/main.mo with fields that can represent: client_id, identifier/email, login_time, ip_address.",
        "Login history entries are stored in canister state so they persist across calls (and across upgrades if the app already supports stable upgrades).",
        "If ip_address is not provided by the caller, the stored value is empty or a clearly defined placeholder (e.g., null/\"Unknown\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Backend: When a client login succeeds (both password login and OTP login flows, if both exist), append a new login history entry capturing identifier/email/mobile, client_id, current timestamp, and an ip_address value provided by the frontend (best-effort). Do not record entries for failed logins.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "Step 2: Login Route Me Record Save Karo Jab client successfully login kare ... Login History Save ..."
        ]
      },
      "acceptanceCriteria": [
        "Successful client password login results in exactly one new login history entry.",
        "Successful client OTP login (if supported) results in exactly one new login history entry.",
        "Failed login attempts (wrong password/invalid OTP/user not found/rate limited) do not create login history entries.",
        "The login_time stored is based on the backend canister time (Time.now())."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Backend: Expose an admin-only query method to fetch login history entries ordered by most recent first. The method must require a valid admin session token and trap on unauthorized access.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "✅ Step 3: Admin Panel Me Login History Show Karna ... app.get(\"/admin/login-history\" ... ORDER BY login_time DESC"
        ]
      },
      "acceptanceCriteria": [
        "A new backend method (admin-only) returns an array of login history entries sorted descending by login_time.",
        "Calling the method with an invalid/expired admin token traps with an unauthorized error (following existing patterns like other admin-only queries)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Frontend: Add a new \"Login History\" section in the Admin Dashboard tabs and render a table showing: Client Email/Identifier, Login Time, IP Address. All user-facing text must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "Admin Dashboard me ek section add karo ... Frontend table: Client Email, Login Time, IP Address"
        ]
      },
      "acceptanceCriteria": [
        "AdminDashboard includes a new tab labeled \"Login History\" visible only when the admin is authenticated (consistent with existing dashboard behavior).",
        "The Login History view shows a table with columns: Client Email/Identifier, Login Time, IP Address.",
        "Login Time is displayed in a readable format (e.g., local date/time string) and the table is ordered newest-first.",
        "The UI includes loading and empty states consistent with the rest of the admin panels (skeleton/loading indicator and an empty message like \"No login history yet\")."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Frontend: Add React Query wiring (hook/query key) to fetch login history from the backend using the current adminToken, and ensure the query is disabled when no actor or no adminToken is available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ]
      },
      "acceptanceCriteria": [
        "A new React Query hook exists in frontend/src/hooks/useQueries.ts to fetch login history using actor + adminToken.",
        "The query key is stable and includes adminToken similarly to existing admin queries (e.g., ['loginHistory', adminToken]).",
        "The Login History admin UI uses the hook and correctly handles loading/error/empty states."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Do not assume the backend can access the client IP address directly; store IP only if provided by the frontend as best-effort input."
  ],
  "nonGoals": [
    "Do not implement third-party auth providers or external databases (no SQL tables).",
    "Do not record admin login history unless explicitly requested.",
    "Do not add real-time updates/streaming for login history; fetch-on-view is sufficient."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}