{
  "kind": "build_request",
  "title": "Add email/password client signup + login + logout with unique email and protected client dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for email/password client accounts with a unique email constraint, including: (1) signup that rejects duplicate emails, (2) login that verifies a hashed password and returns a client session token, (3) logout that invalidates the current client session token, and (4) a way to retrieve the currently-authenticated client account status using the session token (needed for protected dashboard access).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Is add kar do"
        ]
      },
      "acceptanceCriteria": [
        "Signing up with a new email creates exactly one account for that email and stores the password as a hash (never plaintext).",
        "Signing up again with the same email fails with a clear error (e.g., \"Email already registered\").",
        "Logging in with (email, password) for an existing account returns a non-empty session token and creates/refreshes a server-side session record with an expiration time.",
        "Logging in with an unknown email fails with a clear error (e.g., \"User not found\").",
        "Logging in with a wrong password fails with a clear error (e.g., \"Wrong password\").",
        "Calling logout invalidates the session token so it can no longer be used to access protected client data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a client signup UI to the React app that matches the existing client portal flow: provide an email + password signup form, link it from the client login screen, show clear English success/error messages, and after successful signup guide the user to log in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "📄 views/signup.html",
          "📄 views/login.html"
        ]
      },
      "acceptanceCriteria": [
        "Client Portal shows a way to navigate between \"Log in\" and \"Create account\" without page reloads (React flow).",
        "Signup form validates required fields and prevents empty/invalid email input.",
        "On successful signup, the UI shows an English confirmation (e.g., \"Signup successful. Please log in.\") and routes the user back to the login form.",
        "On duplicate email, the UI shows an English error message (e.g., \"Email already registered\")."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the client dashboard area remains protected by client authentication: if there is no valid client session token, the UI must not render the client dashboard and must prompt for login; if a session expires/is invalidated, the UI must return to the client login screen.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Protected dashboard",
          "Session login"
        ]
      },
      "acceptanceCriteria": [
        "When no client session token exists in storage, the client dashboard is not accessible and the client login UI is shown.",
        "When an invalid/expired token is detected by backend calls, the frontend clears the stored token and returns the user to the client login UI.",
        "After logout, the stored token is cleared and the dashboard is no longer accessible without logging in again."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add basic role support for email/password accounts (client/admin) in backend user records, defaulting to \"client\" on signup, and persist the account creation timestamp.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "role ENUM('client','admin') DEFAULT 'client',",
          "created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP"
        ]
      },
      "acceptanceCriteria": [
        "Newly created email/password accounts have role set to \"client\" by default.",
        "Each created account stores a creation timestamp.",
        "Existing persisted data remains readable after upgrade; if stored user/account records exist already, they receive safe defaults for any newly-added fields."
      ]
    }
  ],
  "constraints": [
    "Do not add Node.js/Express/MySQL code; implement the requested behavior using the existing Internet Computer (Motoko) backend and React frontend.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if required to preserve existing stable state.",
    "Do not edit files under frontend/immutablePaths (compose existing UI components instead).",
    "Use English for all user-facing UI text and error messages."
  ],
  "nonGoals": [
    "Do not implement third-party authentication providers (only the app’s built-in auth patterns).",
    "Do not add external databases (e.g., MySQL) or server-side Express sessions; use canister-based persistence/session handling.",
    "Do not add real-time features (WebSockets) or email/SMS delivery integrations beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}