{
  "kind": "build_request",
  "title": "Fix client login failure by adding identifier validation and consistent client-account lookup/session issuance",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Client Portal password-login UI to validate the identifier (email/mobile) before calling `actor.authenticateClient(...)`, and show clear English guidance when the input is malformed (e.g., an email missing '@' or a mobile number not 10 digits).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "jatinsharmas336gmail.com\nPassword hai JATIN1234"
        ]
      },
      "acceptanceCriteria": [
        "If the user enters an email-like value without '@' (e.g., `jatinsharmas336gmail.com`) and clicks Login, the UI does not call the backend and instead shows an English message explaining that the email address is invalid and must include '@'.",
        "If the user enters a mobile number, the UI enforces 10 digits (digits only) and shows an English message if invalid.",
        "Existing OTP login tab behavior remains unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure backend client-account provisioning and lookup are consistent: accounts created via `createClientAccount(email, mobile, temporaryPassword, profile, adminToken)` must be discoverable by `authenticateClient(emailOrMobile, password)` using either the stored email or stored mobile (after trimming/normalizing), and successful authentication must create and persist a non-empty `ClientSession` token usable by subsequent client-authorized queries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "project_state.json"
        ],
        "quotes": [
          "Ensure backend client-account provisioning and lookup are consistent: accounts created via the admin provisioning flow (`actor.createClientAccount(...)`) must be discoverable by the same identifier(s) accepted by client login (`actor.authenticateClient(emailOrMobile, password)`), and the backend must issue and persist a valid `ClientSession` that can be used by subsequent client-authorized queries (e.g., `getClientAccountStatus`, `getShipmentsByClient`, `getInvoicesByClient`)."
        ]
      },
      "acceptanceCriteria": [
        "Given a client account provisioned with an email, `authenticateClient(email, password)` returns a non-empty session token and stores a corresponding session in backend state.",
        "Given a client account provisioned with a mobile number, `authenticateClient(mobile, password)` returns a non-empty session token and stores a corresponding session in backend state.",
        "After receiving a session token, client-authorized queries that accept `clientSessionToken` (e.g., `getClientAccountStatus`, `getShipmentsByClient`, `getInvoicesByClient`) accept the token without trapping for 'Invalid or expired client session token' (until timeout).",
        "Failed authentication continues to return a clear error condition (trap or empty token) that the frontend maps to a user-friendly message (no sensitive details leaked)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve client login error feedback so the UI distinguishes between (a) invalid input format (frontend validation), (b) account not found, and (c) wrong password, using consistent English messages via `getClientAuthErrorMessage(...)`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Invalid email/mobile or password"
        ]
      },
      "acceptanceCriteria": [
        "When backend indicates account not found, the UI shows an English 'Account not found' message (and does not show a generic 'invalid credentials' message).",
        "When backend indicates wrong password, the UI shows an English 'Invalid email/mobile or password' message.",
        "When the identifier format is invalid (e.g., missing '@'), the UI shows the format-specific validation message without contacting the backend."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify any files under `frontend/src/hooks/useInternetIdentity.ts` / `.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose existing components instead).",
    "Use English for any user-facing UI text."
  ],
  "nonGoals": [
    "Implementing email-based 'Set Password' links or 'Forgot Password' email reset in this change set.",
    "Adding third-party authentication providers or external databases.",
    "Changing OTP provider/integration behavior beyond what is needed for session issuance consistency."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}