{
  "kind": "build_request",
  "title": "Fix admin login by updating backend admin password to JATINSHARMA2580",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend admin password so that the Admin Login accepts the exact password `JATINSHARMA2580` and no longer rejects it as invalid.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-15"
        ],
        "quotes": [
          "JATINSHARMA2580",
          "Haan final"
        ]
      },
      "acceptanceCriteria": [
        "Calling `adminLogin(\"JATINSHARMA2580\")` returns a non-null session token.",
        "Attempting to log in via the Admin Login UI using password `JATINSHARMA2580` successfully authenticates and opens the admin dashboard.",
        "Attempting to log in with any other password fails with an 'Invalid admin password' error message in the UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the admin password change persists correctly across upgrades for already-deployed canisters (i.e., upgrading the canister must not keep/reset the admin password to the old value).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-15"
        ],
        "quotes": [
          "Is problem ko theek kar do only is problem ko",
          "Haan final"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade deployment, the Admin Login still accepts `JATINSHARMA2580`.",
        "No migration/upgrade logic resets the admin password to a different value than `JATINSHARMA2580`."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify any files under frontend/src/components/ui or any other frontend immutable paths."
  ],
  "nonGoals": [
    "Do not add new authentication methods (e.g., Internet Identity, third-party auth).",
    "Do not redesign the admin UI beyond what is required to confirm the password fix.",
    "Do not change client login/OTP flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}