{
  "kind": "build_request",
  "title": "Update tracking status format, seed example tracking IDs, and add password gate for admin panel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update the public “Track Your Shipment” section behavior to match the user-provided HTML/JS: normalize the entered Tracking ID to uppercase before lookup; when a matching shipment exists, display the stored status string exactly as-is (do not prefix it with \"Status: \"); when no match exists, display exactly: \"❌ Invalid Tracking ID. Please Contact DFC Office.\"",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "function trackShipment(){\n    var id = document.getElementById(\"trackingID\").value.toUpperCase();\n    var result = shipments[id];\n\n    if(result){\n        document.getElementById(\"trackingResult\").innerHTML = result;\n    } else {\n        document.getElementById(\"trackingResult\").innerHTML = \"❌ Invalid Tracking ID. Please Contact DFC Office.\";\n    }\n}"
        ]
      },
      "acceptanceCriteria": [
        "Entering \"dfc1001\" (lowercase) successfully finds the same record as \"DFC1001\" (uppercase).",
        "If localStorage has a record for the entered ID with value \"✅ Load Confirmed - Truck Loaded from Kalamboli\", the UI displays exactly that string (including emoji) and does not add any extra prefix text.",
        "If there is no record for the entered ID, the UI displays exactly: \"❌ Invalid Tracking ID. Please Contact DFC Office.\""
      ]
    },
    {
      "id": "REQ-18",
      "text": "Seed localStorage shipments with the exact example Tracking IDs and statuses provided by the user when shipments storage is empty (first run / no shipments yet), without overwriting any existing shipments data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "var shipments = {\n    \"DFC1001\": \"✅ Load Confirmed - Truck Loaded from Kalamboli\",\n    \"DFC1002\": \"🚛 In Transit - Reached Gujarat Border\",\n    \"DFC1003\": \"📦 Arrived at Destination - Ready for Unloading\"\n};"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh browser profile where localStorage key \"shipments\" is missing or is an empty object, the app initializes it to include DFC1001, DFC1002, and DFC1003 with the exact status strings provided (including emojis).",
        "If localStorage \"shipments\" already contains any data, the app does not replace or remove existing entries during initialization."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a password protection gate for the Admin Tracking Panel so that shipment add/update/delete controls and the shipments table are hidden until the correct admin password is entered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Maine tujhe do html bhej diye Hain ek admin ko password sehore rahega"
        ]
      },
      "acceptanceCriteria": [
        "When the user navigates/scrolls to the Admin section, they see a password prompt instead of the admin management UI until authenticated.",
        "If an incorrect password is entered, show an English error message and do not reveal the admin management UI.",
        "After the correct password is entered, the full Admin Tracking Panel UI becomes visible and usable.",
        "Reloading the page returns to the locked state unless the app explicitly persists an \"unlocked\" flag (if persisted, provide a visible Logout/Lock button to re-lock the admin panel)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Update the Admin Tracking Panel shipment status input to support saving the full, custom status text (including emojis and additional details), rather than being limited to a fixed dropdown list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "\"DFC1001\": \"✅ Load Confirmed - Truck Loaded from Kalamboli\""
        ]
      },
      "acceptanceCriteria": [
        "Admin can save a shipment status value containing emojis and detailed text (e.g., \"🚛 In Transit - Reached Gujarat Border\").",
        "After saving, the public tracking lookup displays that exact saved status string for the same Tracking ID."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must not modify any files under frontend/src/components/ui or other paths listed in frontend.immutablePaths.",
    "Do not introduce any backend dependency for tracking; shipment tracking data must remain stored in browser localStorage under the key \"shipments\"."
  ],
  "nonGoals": [
    "Implementing secure, server-side authentication/authorization for the admin panel.",
    "Adding a backend database or moving shipment tracking storage to the Motoko canister.",
    "Changing the marketing-site sections (Hero/Services/Stats/About/Testimonials/Contact/Footer) beyond what is necessary to support the requested tracking/admin behavior updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}