{
  "kind": "build_request",
  "title": "Configure Google Maps API key for Admin Live Tracking map",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Configure the Google Maps JavaScript API key so the Admin Dashboard “Live Tracking” tab successfully loads Google Maps and renders shipment markers. Use this exact key value: \"AIzaSyC0ZPKa3tgNMATa8PwdUheyhIAH1E3Gi9o\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "<script src=\"https://maps.googleapis.com/maps/api/js?key=AIzaSyC0ZPKa3tgNMATa8PwdUheyhIAH1E3Gi9o&callback=initMap\" async defer></script>",
          "Is app ki key add karo"
        ]
      },
      "acceptanceCriteria": [
        "When VITE_GOOGLE_MAPS_API_KEY is set to \"AIzaSyC0ZPKa3tgNMATa8PwdUheyhIAH1E3Gi9o\", the Admin Dashboard > Live Tracking view loads the Google Maps script using the callback=initMap parameter (via the existing dynamic loader in AdminTrackingPanel).",
        "If the API key is not set, the Live Tracking view shows the existing English warning message that the Google Maps API key is not configured (no blank/white map).",
        "With at least one shipment that has coordinates, the map renders and shows a marker per shipment with coordinates, and clicking a marker opens an info window with shipment details."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components).",
    "Keep the frontend implementation in React (no new standalone admin-dashboard.html or public/maps.js page flow).",
    "Do not add external backend services or REST endpoints; keep using the existing backend actor calls and React Query hooks for shipment data."
  ],
  "nonGoals": [
    "Implementing a new static HTML admin dashboard page (admin-dashboard.html).",
    "Creating a separate public/maps.js file that fetches \"/api/shipments\" via REST.",
    "Securing/obfuscating the Google Maps API key beyond standard Google-side restrictions (e.g., HTTP referrer restrictions), unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}