{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Client signup normalization and friendly trap error messaging",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Use validateClientIdentifier’s validated/normalized identifier to determine email vs mobile and to submit the normalized value in the signup payload.",
      "acceptanceCriteria": [
        "If a user enters a mobile number with spaces/dashes, the signup request uses the normalized 10-digit number.",
        "If a user enters an email with leading/trailing whitespace, the signup request uses the trimmed/normalized email.",
        "The signup form no longer produces backend errors caused by sending an unnormalized identifier type (email vs mobile)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clientIdentifier.ts",
          "operation": "modify",
          "description": "Adjust validateClientIdentifier to return enough information to drive UI decisions (e.g., include identifier type: email vs mobile) and to normalize mobile inputs that include spaces/dashes into digit-only form while still enforcing 10 digits."
        },
        {
          "path": "frontend/src/components/client/ClientSignupCard.tsx",
          "operation": "modify",
          "description": "Update signup submission logic to use validateClientIdentifier’s normalized output (and its identifier type) when setting email vs mobile fields and when sending identifier/email/mobile values to useClientSignup, instead of using raw form input and a naive '@' check."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Map the specific backend trap text \"blob too long for principal\" to a user-friendly English message and prevent raw trap text from being shown during signup.",
      "acceptanceCriteria": [
        "If the backend ever returns an error containing \"blob too long for principal\", the UI displays a clear English message (e.g., \"Signup failed due to a server error. Please try again.\") instead of the raw text.",
        "Other existing error mappings remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clientAuthErrors.ts",
          "operation": "modify",
          "description": "Add a targeted error-message mapping: if the error message contains \"blob too long for principal\" (case-insensitive), return a safe, user-friendly English message and do not surface the raw trap text; keep all other existing mappings unchanged."
        }
      ]
    }
  ]
}