{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Client Portal login validation + improved client auth error messaging (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add identifier (email/mobile) format validation to Client Portal password login and show clear English guidance without calling backend when malformed, while keeping OTP login unchanged.",
      "acceptanceCriteria": [
        "If the user enters an email-like value without '@' (e.g., `jatinsharmas336gmail.com`) and clicks Login, the UI does not call the backend and instead shows an English message explaining that the email address is invalid and must include '@'.",
        "If the user enters a mobile number, the UI enforces 10 digits (digits only) and shows an English message if invalid.",
        "Existing OTP login tab behavior remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clientIdentifier.ts",
          "operation": "create",
          "description": "Create a small utility to trim/normalize the client identifier and validate whether it is a valid email (must include '@') or a 10-digit mobile number (digits only), returning a validation result with a user-facing English message for invalid cases."
        },
        {
          "path": "frontend/src/components/client/ClientPortalLoginCard.tsx",
          "operation": "modify",
          "description": "Update the password-login flow to validate/normalize the identifier (email/mobile) before calling the authenticate mutation; when invalid, show a clear English validation message inline (e.g., using shadcn-ui Alert) and do not invoke the backend. Use existing shadcn-ui components (Input, Alert, Tabs, Button) to present validation feedback; verify the component's usage instructions before implementing. Ensure OTP tab logic and behavior remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve client login error feedback so UI distinguishes invalid input format vs account not found vs wrong password with consistent English messages via getClientAuthErrorMessage(...).",
      "acceptanceCriteria": [
        "When backend indicates account not found, the UI shows an English 'Account not found' message (and does not show a generic 'invalid credentials' message).",
        "When backend indicates wrong password, the UI shows an English 'Invalid email/mobile or password' message.",
        "When the identifier format is invalid (e.g., missing '@'), the UI shows the format-specific validation message without contacting the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clientAuthErrors.ts",
          "operation": "modify",
          "description": "Refine error-to-message mapping so backend 'account not found' signals consistently map to 'Account not found.' and wrong-password/invalid-credentials signals map to 'Invalid email/mobile or password.' Keep messages concise, English-only, and avoid leaking sensitive details."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust client authentication mutations to preserve backend-provided error signals (e.g., account-not-found traps) while treating only null/empty tokens as wrong-password/invalid-credentials. Avoid throwing overly-generic errors that would prevent the UI from distinguishing 'Account not found' vs 'Invalid email/mobile or password' via getClientAuthErrorMessage(...)."
        },
        {
          "path": "frontend/src/components/client/ClientPortalLoginCard.tsx",
          "operation": "modify",
          "description": "Wire updated getClientAuthErrorMessage(...) behavior into password-login error presentation so backend-driven failures show the correct English message, while frontend identifier validation remains the first-line check (no backend call when invalid). Use existing shadcn-ui feedback patterns (e.g., Alert/toast) and verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}