{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin login history table with React Query hook",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add an authenticated-only \"Login History\" tab to the Admin Dashboard that displays a newest-first table of client login history with loading and empty states (English text only).",
      "acceptanceCriteria": [
        "AdminDashboard includes a new tab labeled \"Login History\" visible only when the admin is authenticated (consistent with existing dashboard behavior).",
        "The Login History view shows a table with columns: Client Email/Identifier, Login Time, IP Address.",
        "Login Time is displayed in a readable format (e.g., local date/time string) and the table is ordered newest-first.",
        "The UI includes loading and empty states consistent with the rest of the admin panels (skeleton/loading indicator and an empty message like \"No login history yet\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminLoginHistoryPanel.tsx",
          "operation": "create",
          "description": "Create an AdminLoginHistoryPanel component that renders a table for login history entries (identifier/email, formatted login time, IP address) with skeleton loading, error state, and an English empty state message (e.g., \"No login history yet\"). Use shadcn-ui table primitives already used elsewhere (e.g., Table/TableHead/TableRow) to match existing admin tables. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Wire the new \"Login History\" tab into the existing AdminDashboard TabsList/TabsContent, ensuring it is only reachable when isAuthenticated is true (already enforced by AdminDashboard). Update the tab grid column count as needed and render AdminLoginHistoryPanel in its TabsContent. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a React Query hook in useQueries.ts to fetch admin login history using actor + adminToken, with a stable query key and disabled behavior when prerequisites are missing.",
      "acceptanceCriteria": [
        "A new React Query hook exists in frontend/src/hooks/useQueries.ts to fetch login history using actor + adminToken.",
        "The query key is stable and includes adminToken similarly to existing admin queries (e.g., ['loginHistory', adminToken]).",
        "The Login History admin UI uses the hook and correctly handles loading/error/empty states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useGetLoginHistory React Query hook that calls the existing backend capability to fetch login history using actor + adminToken. Ensure a stable query key that includes adminToken (e.g., ['loginHistory', adminToken]) and set enabled to false when actor is missing, actor is fetching, or adminToken is missing—consistent with other admin queries. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminLoginHistoryPanel.tsx",
          "operation": "modify",
          "description": "Use the new useGetLoginHistory hook to fetch data and drive loading/error/empty/success rendering. Ensure the displayed rows are newest-first (preserve backend ordering and optionally re-sort by loginTime descending defensively) and format loginTime as a readable local date/time string. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}