{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a Node.js (Express) + MySQL web app with user authentication: signup/login/logout using bcrypt-hashed passwords, session-based auth, unique email constraint, and a protected client dashboard with basic role support (client/admin).",
  "architectural_notes": [
    "Use Node.js + Express server with MySQL (mysql2) database connection.",
    "Authentication uses bcrypt password hashing and express-session for session-based login.",
    "Static HTML pages served from /views; protect dashboard route by checking session userId.",
    "Users table includes unique email constraint and role enum (client/admin)."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-add-a-client-signup-ui-to-the-react-app-that-matches-the-existing-client-portal-flow-provide-an-email-password-signup-form-link-it-from-the-client-login-screen-show-clear-english-success-error-messages-and-after-successful-signup-guide-the-user-to-log-in",
      "title": "Add a client signup UI to the React app that matches the existing client portal flow: provide an email + password signup form, link it from the client login screen, show clear English success/error messages, and after successful signup guide the user to log in.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-client-dashboard-area-remains-protected-by-client-authentication-if-there-is-no-valid-client-session-token-the-ui-must-not-render-the-client-dashboard-and-must-prompt-for-login-if-a-session-expires-is-invalidated-the-ui-must-return-to-the-client-login-screen",
      "title": "Ensure the client dashboard area remains protected by client authentication: if there is no valid client session token, the UI must not render the client dashboard and must prompt for login; if a session expires/is invalidated, the UI must return to the client login screen.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add MySQL-backed user authentication (users table, signup/login/logout) with bcrypt password hashing, express-session, unique email, role field, and protected client dashboard pages.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement backend support for email/password client accounts with a unique email constraint, including: (1) signup that rejects duplicate emails, (2) login that verifies a hashed password and returns a client session token, (3) logout that invalidates the current client session token, and (4) a way to retrieve the currently-authenticated client account status using the session token (needed for protected dashboard access).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Add basic role support for email/password accounts (client/admin) in backend user records, defaulting to \"client\" on signup, and persist the account creation timestamp.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add email/password client signup + login + logout with unique email and protected client dashboard",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}